#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
Сборка
"""

# ######################################################################################################################
# Импорт необходимых инструментов
# ######################################################################################################################
# Подавление Warning
import warnings
for warn in [UserWarning, FutureWarning]: warnings.filterwarnings('ignore', category = warn)

from dataclasses import dataclass  # Класс данных

# Персональные
from neweraai.modules.lab.audio import Audio  # Аудио

# ######################################################################################################################
# Сборка
# ######################################################################################################################
@dataclass
class Run(Audio):
    """Сборка"""

    # ------------------------------------------------------------------------------------------------------------------
    # Конструктор
    # ------------------------------------------------------------------------------------------------------------------

    metadata_: bool = True  # Информация об пакете

    def __post_init__(self):
        super().__post_init__()  # Выполнение конструктора из суперкласса

        if self.is_notebook is True and type(self.metadata_) is bool and self.metadata_ is True: self._metadata_info()